server/app/controllers/application_controller.rb

  def current_user
    auth_header = request.headers['Authorization']
    if auth_header
      user_token = auth_header.split(' ')[1]
      begin
        @user_id = JWT.decode(user_token, Rails.application.secrets.secret_key_base[0])[0]['user_id']
      rescue JWT::DecodeError
        nil
      end
    end

    if (@user_id)
      @user = User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]